test/report_1000t/statistics.json
{
  "POST /seckill/do/2" : {
    "transaction" : "POST /seckill/do/2",
    "sampleCount" : 5608,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 456.59415121255205,
    "medianResTime" : 469.0,
    "minResTime" : 5.0,
    "maxResTime" : 800.0,
    "pct1ResTime" : 622.0,
    "pct2ResTime" : 657.0,
    "pct3ResTime" : 737.9099999999999,
    "throughput" : 360.17983301220295,
    "receivedKBytesPerSec" : 75.01266959698137,
    "sentKBytesPerSec" : 117.27988770472061
  },
  "POST /seckill/do/1" : {
    "transaction" : "POST /seckill/do/1",
    "sampleCount" : 5682,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 458.10929250264036,
    "medianResTime" : 469.0,
    "minResTime" : 6.0,
    "maxResTime" : 822.0,
    "pct1ResTime" : 622.0,
    "pct2ResTime" : 659.0,
    "pct3ResTime" : 726.3400000000001,
    "throughput" : 364.8388339540259,
    "receivedKBytesPerSec" : 75.93779847421986,
    "sentKBytesPerSec" : 118.80107922258252
  },
  "POST /seckill/do/4" : {
    "transaction" : "POST /seckill/do/4",
    "sampleCount" : 5622,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 458.2812166488798,
    "medianResTime" : 469.0,
    "minResTime" : 7.0,
    "maxResTime" : 823.0,
    "pct1ResTime" : 623.0,
    "pct2ResTime" : 660.0,
    "pct3ResTime" : 735.0,
    "throughput" : 360.98625914986513,
    "receivedKBytesPerSec" : 75.27676586377937,
    "sentKBytesPerSec" : 117.54385062845127
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 28216,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 457.50910830734216,
    "medianResTime" : 500.0,
    "minResTime" : 5.0,
    "maxResTime" : 823.0,
    "pct1ResTime" : 623.0,
    "pct2ResTime" : 652.0,
    "pct3ResTime" : 708.0,
    "throughput" : 1811.7375112366765,
    "receivedKBytesPerSec" : 377.5803597943688,
    "sentKBytesPerSec" : 589.9455196762232
  },
  "POST /seckill/do/3" : {
    "transaction" : "POST /seckill/do/3",
    "sampleCount" : 5674,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 458.59763835036983,
    "medianResTime" : 469.0,
    "minResTime" : 5.0,
    "maxResTime" : 814.0,
    "pct1ResTime" : 622.0,
    "pct2ResTime" : 657.25,
    "pct3ResTime" : 745.25,
    "throughput" : 364.32515731347115,
    "receivedKBytesPerSec" : 75.9278911366701,
    "sentKBytesPerSec" : 118.63622865031464
  },
  "POST /seckill/do/5" : {
    "transaction" : "POST /seckill/do/5",
    "sampleCount" : 5630,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 455.9467140319719,
    "medianResTime" : 469.0,
    "minResTime" : 5.0,
    "maxResTime" : 818.0,
    "pct1ResTime" : 618.0,
    "pct2ResTime" : 650.0,
    "pct3ResTime" : 720.0,
    "throughput" : 361.52314904000514,
    "receivedKBytesPerSec" : 75.44934542156295,
    "sentKBytesPerSec" : 117.72215432960894
  }
}